Autodesk.Revit.DB.FabricationPart.FixDuplicateGUIDs(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Eliminate duplicate part GUIDs by assiging new GUIDs to parts with duplicated ones.
Remarks:
Tries to change the parts that are last in the list.
If later parts can't be changed then earlier parts will be changed if possible.
document:
The document.
ids:
List of element Ids of fabrication parts to check.
Returns:
Returns a list of fabrication part element Ids that were changed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016